Documents/ПеремещениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПеремещениеОС</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеОС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>InformationRegister.СоответствиеДатчиковИОсновныхСредств</xr:Item>
				<xr:Item>InformationRegister.СостояниеОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФООтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФОПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОтправитель</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФормироватьПроводкиПоБалансовымСчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаполнятьСуммуДтЗабалансовогоСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружатьВБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаЗабалансовый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиницаОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиницаПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПривязкаДатчиков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Датчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Датчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоВыкладки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПеремещениеОС/Forms/ФормаПервоначальнойПривязкиДатчиков/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	
	Для Каждого Стр Из Параметры.ТЗПривязки Цикл
		НовСтр = ТаблицаПривязки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
		НовСтр.ОрганизацияНЕРавна = НовСтр.Организация <> Организация;		
		
	КонецЦикла;
	
	ТаблицаПривязки.Сортировать("СтруктурнаяЕдиница, Датчик");
	
	Сч = 0;
	
	Для Каждого Стр Из ТаблицаПривязки Цикл
		Сч = Сч + 1;
		Стр.НомерСтроки = Сч;
	КонецЦикла;
	
	Для Каждого Стр Из Параметры.ТаблицаДатчикиПоОсам Цикл
		НовСтр = ТаблицаДатчикиПоОсам.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;  	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьДатчикиМестами(Команда)
	
	ВыдСтроки = Элементы.ТаблицаПривязки.ВыделенныеСтроки;	
	
	Если ВыдСтроки.Количество() > 2 Тогда
		Предупреждение("Выбрано более 2-х строк таблицы. Необходимо выбрать 2 строки для переноса датчиков между ними!");
		Возврат;
	ИначеЕсли ВыдСтроки.Количество() =  1 Тогда
		Предупреждение("Выбрана только 1 строка таблицы. Необходимо выбрать 2 строки для переноса датчиков между ними!");
		Возврат;
	ИначеЕсли ВыдСтроки.Количество() = 0 Тогда
		Предупреждение("Не выбрано ни одной строки таблицы. Необходимо выбрать 2 строки для переноса датчиков между ними!");
		Возврат;
	КонецЕсли;
	
	
	Строка1 = ТаблицаПривязки.НайтиПоИдентификатору(ВыдСтроки[0]);
	Строка2 = ТаблицаПривязки.НайтиПоИдентификатору(ВыдСтроки[1]);
	
	Если Строка1.СтруктурнаяЕдиница <> Строка2.СтруктурнаяЕдиница Тогда
		Предупреждение("Менять датчики местами можно только в пределах одной структурной единицы!!!");
		Возврат;
	КонецЕсли;
	
	ДатчикПромежуточный = Строка1.Датчик;
	МестоПромежуточное = Строка1.МестоВыкладки;
	Строка1.Датчик = Строка2.Датчик;
	Строка1.МестоВыкладки = Строка2.МестоВыкладки;
	Строка2.Датчик = ДатчикПромежуточный;
	Строка2.МестоВыкладки = МестоПромежуточное;
	
	ОбновитьНадписьКоличествоНеПривязанныхДатчиков();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПривязкиДатчикПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПривязки.ТекущиеДанные;
	
	НайдСтроки = ТаблицаПривязки.НайтиСтроки(Новый Структура("Датчик", ТекДанные.Датчик));
	
	Если НайдСтроки.Количество() > 1 Тогда
		Для Каждого НСтр Из НайдСтроки Цикл
			Если НСтр.НомерСтроки <> ТекДанные.НомерСтроки Тогда
				Предупреждение("Выбранный датчик уже используется в строке: " +  Строка(НСтр.НомерСтроки) +"! В этой строке датчик будет очищен.");
				НСтр.Датчик = ПредопределенноеЗначение("Справочник.Датчики.ПустаяСсылка");
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ТаблицаВозврата = ПолучитьТаблицуВозвратаСервер();
	
	ЭтаФорма.Закрыть(ТаблицаВозврата);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуВозвратаСервер()
	
	МассивСтрДляУд = Новый Массив;
	
	ТаблицаВозврата = ТаблицаПривязки.Выгрузить();
	
	Для Каждого Стр Из ТаблицаВозврата Цикл
		Если Не ЗначениеЗаполнено(Стр.ОсновноеСредство) Тогда
			МассивСтрДляУд.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для КАждого Стр Из МассивСтрДляУд Цикл
		ТаблицаВозврата.Удалить(Стр);
	КонецЦикла;	
	
	Возврат ТаблицаВозврата;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПривязкиОсновноеСредствоПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПривязки.ТекущиеДанные;
	
	Если ТекДанные.Организация <> Организация Тогда
		Предупреждение("Нельзя привязывать датчики по организациям, отличным от организации документа!");
		ТекДанные.ОсновноеСредство = ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	НайдСтроки = ТаблицаДатчикиПоОсам.НайтиСтроки(Новый Структура("ОсновноеСредство", ТекДанные.ОсновноеСредство));
	
	Если НайдСтроки.Количество() Тогда
		НСтр = НайдСтроки[0];
		
		СтрокаПредупреждения = "Данный ОС уже привязан к датчику: " + Строка(НСтр.Датчик) + " - по месту выкладки: " + НСтр.МестоВыкладки + " (магазин: " + Строка(НСтр.Магазин) + ")!";		
		
		Если ТекДанные.СтруктурнаяЕдиница <> НСтр.Магазин Тогда
			СтрокаПредупреждения = СтрокаПредупреждения + " Разные магазины. ОС будет очищено!";
			
			ТекДанные.ОсновноеСредство = ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка");
		КонецЕсли;
		
		Предупреждение(СтрокаПредупреждения);
		
	КонецЕсли;
	
	ОбновитьНадписьКоличествоНеПривязанныхДатчиков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьКоличествоНеПривязанныхДатчиков();
	Элементы.ТаблицаПривязкиУбратьДатичикПоДругимОрганизациям.Пометка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьКоличествоНеПривязанныхДатчиков()
	
	НайдСтроки = ТаблицаПривязки.НайтиСтроки(Новый Структура("ОсновноеСредство", ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка")));
	
	Элементы.тКоличествоНеПривязанных.Заголовок = "Количество не привязанных датчиков: " + Строка(НайдСтроки.Количество());

КонецПроцедуры

&НаКлиенте
Процедура УбратьДатичикПоДругимОрганизациям(Команда)
	
	Элементы.ТаблицаПривязкиУбратьДатичикПоДругимОрганизациям.Пометка = НЕ Элементы.ТаблицаПривязкиУбратьДатичикПоДругимОрганизациям.Пометка;
	
	Если Элементы.ТаблицаПривязкиУбратьДатичикПоДругимОрганизациям.Пометка Тогда
		Элементы.ТаблицаПривязки.ОтборСтрок = Новый ФиксированнаяСтруктура("Организация", Организация);
	Иначе
		Элементы.ТаблицаПривязки.ОтборСтрок = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры
